pathLines/elbow3D/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24850
(
0.4761192194
0.4561574666
0.464021852
0.464936957
0.4647718186
0.464678405
0.4646351278
0.4646150035
...
)
;

boundaryField
{
    pressure-outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
0.9834696997
0.9785396426
0.9546227324
0.9533444997
0.9747053822
0.9856630691
1.082652553
1.025865751
...
)
;
    }
    velocity-inlet-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
0.099810132
0.2266315446
0.2413724642
0.1818877245
0.2283148492
0.2856970509
0.09977511017
0.1534431608
...
)
;
    }
    velocity-inlet-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
0.212351898
0.1164251795
0.2879358799
0.2826937406
0.2826851439
0.108319235
0.250856591
0.2837340761
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
5812
(
1.550599573
0.3132585339
1.517559339
0.2377017978
0.2389014339
1.483360111
0.2146439712
1.552081053
...
)
;
    }
}


// ************************************************************************* //
