pathLines/elbow3D/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24850
(
2.468617845
3.504890032
4.49857473
5.498953954
6.499549504
7.499790832
8.499893752
9.499941738
...
)
;

boundaryField
{
    pressure-outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
53.47670724
54.47509364
55.4915573
56.5020555
57.51494917
58.5113297
51.4100431
52.49117502
...
)
;
    }
    velocity-inlet-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
-3.885780586e-16
...
)
;
    }
    velocity-inlet-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
54.2426297
55.16777683
53.15400777
54.22218991
55.29195278
56.20688493
53.19118823
54.2274716
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
5812
(
2.46655926
0.2393127912
39.55059817
0.2343369423
0.2359749241
44.55556979
0.2318227556
2.466522388
...
)
;
    }
}


// ************************************************************************* //
