pathLines/elbow3D/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24850
(
5.588112051
5.612397484
5.609420851
5.60889283
5.608827415
5.608797301
5.608787559
5.608785443
...
)
;

boundaryField
{
    pressure-outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
72
72
72
72
72
72
72
72
...
)
;
    }
    velocity-inlet-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
6.306420133
7.240610386
8.252382888
9.2362184
4.215166726
11.28615794
12.198182
13.27824592
...
)
;
    }
    velocity-inlet-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
-4.5
-4.5
-4.5
-4.5
-4.5
-4.5
-4.5
-4.5
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
5812
(
5.457519839
6.212386508
6.469840036
7.241423504
8.253831216
8.475407465
9.226985914
10.54110239
...
)
;
    }
}


// ************************************************************************* //
