pathLines/elbow3D/0/ccz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24850
(
-7.376116551
-7.367527032
-7.365947109
-7.365603124
-7.365554073
-7.365551768
-7.365556542
-7.365560957
...
)
;

boundaryField
{
    pressure-outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
-6.495756691
-6.504241969
-6.487684235
-6.48831287
-6.506520154
-6.500115303
-5.541367173
-5.514015349
...
)
;
    }
    velocity-inlet-1
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
-7.698047392
-7.728387966
-7.749233019
-7.702567166
-6.774912571
-6.816446268
-6.665251288
-5.81368118
...
)
;
    }
    velocity-inlet-2
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
-1.742636707
-1.71985113
-0.8050379052
-0.7935741294
-0.8007941538
-0.7062665804
0.2599142684
0.2662505592
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
5812
(
-7.551064418
-7.784348152
-7.52055083
-7.951530227
-7.987530202
-7.507771159
-7.895787485
-7.551482144
...
)
;
    }
}


// ************************************************************************* //
