pathLines/elbow3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    pressure-outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       70319;
    }
    velocity-inlet-1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       70639;
    }
    velocity-inlet-2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       70959;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5812;
        startFace       71011;
    }
)

// ************************************************************************* //
