pathLines/elbow3D/system/blockMeshDict
FoamFile  
{  
    version 2.0;  
    format ascii;  
    class dictionary;  
    location system;  
    object blockMeshDict;  
}  
  
    convertToMeters 1;  
    vertices    
    (  
     (-2.0 -6.0 -9.0) 
     (65.0 -6.0 -9.0) 
     (65.0 73.0 -9.0) 
     (-2.0 73.0 -9.0) 
     (-2.0 -6.0 9.0) 
     (65.0 -6.0 9.0) 
     (65.0 73.0 9.0) 
     (-2.0 73.0 9.0) 
    );  
    blocks    
    ( hex  
      ( 0 1 2 3 4 5 6 7)  
      ( 67 79 18) simpleGrading  
      ( 1 1 1)  
    );  
    edges    
    (  
    );  
    patches    
    ( wall ffminx  
      (  
      ( 0 4 7 3)) wall ffmaxx  
      (  
      ( 1 2 6 5)) wall ffminy  
      (  
      ( 0 1 5 4)) wall ffmaxy  
      (  
      ( 3 7 6 2)) wall ffminz  
      (  
      ( 0 3 2 1)) wall ffmaxz  
      (  
      ( 4 5 6 7))  
    );  
    mergePatchPairs    
    (  
    );  
    spacing 1.0;  
